[
    {
        "title":"hulk",
        
        "storyC":"Bruce Banner (Eric Bana) is a research scientist at a Berkeley, California laboratory. ntains. David has created a trio of superpowered gamma dogs using equipment purloined from the labs. Using a scarf she left behind, he gives the dogs Betty's scent and sends them to kill her. He then calls Bruce to tell him he has done so, to coax the Hulk out of him. Just then Talbot arrives to confront Bruce. Ross has ordered Talbot to leave Betty and Bruce alone, enraging Talbot. He tries to beat Bruce but manages only to anger him enough to cause another transformation into the Hulk. Hulk beats Talbot badly then escapes the Army guards to find and protect Betty. At the mountain cabin, he fights and kills the gamma dogs."
    },

    {
        "title":"the incredible hulk",

        "storyC":"A cure is in reach for the world's most primal force of fury: THE INCREDIBLE HULK. We find scientist Bruce Banner, living in shadows, scouring the planet for an antidote. But the warmongers who dream of abusing his powers won't leave him alone, nor will his need to be with the only woman he has ever loved, Betty Ross. Upon returning to civilization, our brilliant doctor is ruthlessly pursued by The Abomination -- a nightmarish beast of pure adrenaline and aggression whose powers match The Hulk's own. A fight of comic-book proportions ensues as Banner must call upon the hero within to rescue New York City from total destruction. One scientist must make an agonizing final choice -- accept a peaceful life as Bruce Banner or the creature he could permanently become: THE INCREDIBLE HULK."
    },

    {
        "title":"spider man",

        "storyC":"A rather odd thing has just occurred in the life of nerdy high school student Peter Parker: after being bitten by a genetically modified spider, his body chemistry is altered mutagenically. He can now scale walls and ceilings, he has superhuman strength and super-fast reflexes, and he develops a precognitive sense that warns him of approaching danger. Adopting the name Spider-Man, Peter first uses his newfound powers to make money, but after his uncle is murdered at the hands of a criminal Peter failed to stop, he swears to use his powers to fight the evil that killed his uncle. At the same time, scientist and businessman Norman Osborn, after exposure to an experimental nerve gas, develops an alternate personality himself: the super-strong, psychotic Green Goblin! Peter Parker must now juggle three things in his life: his new job at a local newspaper under a perpetually on-edge employer, his battle against the evil Green Goblin, and his fight to win the affections of beautiful classmate Mary Jane Watson, against none other than his best friend Harry Osborn, son of Norman Osborn! Is this challenge too much for even the Amazing Spider-Man to handle?"
    },

    {
        "title":"spider man 2",

        "storyC":"Peter Parker can't seem to catch any kind of break. Being Spider-Man has brought him nothing but problems as far as his personal life is concerned. Not only that, Mary Jane Watson is engaged to astronaut John Jameson, and Peter may lose her forever. Things are so bad for him that he is pushed past his breaking point, so he decides that he doesn't want to be a super hero anymore, until a freak accident transforms Dr. Otto Octavius into Dr. Octopus, a super-villain with four metal tentacles protruding from his torso. Peter realizes that only Spider-Man can stop him but, of course, problems arise. Mary Jane gets caught in the middle, and Harry Osborn, who still blames the web-slinger for the death of his father Norman Osborn, also the Green Goblin, wants him dead. Spider-Man will have to push himself past his limits if he's going to survive."
    },

    {
        "title":"spider man 3",

        "storyC":"After Mary Jane and Peter Parker have confessed their love for one another, we start things off with them happier than ever. Spider-Man is still doing what he does best - saving the world. Mary Jane is the star of a great Broadway show. However, through all the silver linings, Harry is still blaming Peter for killing his father. After multiple attempts at trying to reason with him and patch things up, Harry finally confronts Peter and they engage in a brutal battle leaving Harry with temporary amnesia. During this time Peter encounters a symbiote, which attaches itself to his Spidey suit. After awhile Peter can feel a difference in his behavior (more aggressive) but as well his powers are amplified. Struggling to save his relationship with Mary Jane he removes the suit using the bells of the church and the suit finally grabs hold of Eddie Brock. Eddie was currently praying Peter would be killed for all the embarrassment that Peter's caused him. Not a minute too soon, Peter gets back to normal, but seems to have lost Mary Jane - and what's worse is she is held captive by Venom and Sandman - who have seem to have join forces. After realizing this, Peter asks Harry for help, but is declined since Harry has gotten his memory back. As Peter goes to face both villains, Harry is told the truth about his father and decides to help Spider-Man. The final battle comes down to Harry and Spider-Man against Venom and Sandman. Who will win?"
    },

    {
        "title":"TAS",

        "storyC":"Peter Parker (Garfield) is an outcast high schooler who was abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben (Sheen) and Aunt May (Field). Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. Peter is also finding his way with his first high school crush, Gwen Stacy (Stone), and together, they struggle with love, commitment, and secrets. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance - leading him directly to Oscorp and the lab of Dr. Curt Connors (Ifans), his father's former partner. As Spider-Man is set on a collision course with Connors' alter-ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero."

    },

    {
        "title":"TAS 2",

        "storyC":"We've always known that Spider-Man's most important conflict has been within himself: the struggle between the ordinary obligations of Peter Parker and the extraordinary responsibilities of Spider-Man. But in The Amazing Spider-Man 2, Peter Parker finds that his greatest battle is about to begin. It's great to be Spider-Man. For Peter Parker, there's no feeling quite like swinging between skyscrapers, embracing being the hero, and spending time with Gwen. But being Spider-Man comes at a price: only Spider-Man can protect his fellow New Yorkers from the formidable villains that threaten the city. With the emergence of Electro, Peter must confront a foe far more powerful than he. And as his old friend, Harry Osborn, returns, Peter comes to realize that all of his enemies have one thing in common: Oscorp."
    },

    {
        "title":"The amazing spiderman",

        "storyC":"Peter Parker (Garfield) is an outcast high schooler who was abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben (Sheen) and Aunt May (Field). Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. Peter is also finding his way with his first high school crush, Gwen Stacy (Stone), and together, they struggle with love, commitment, and secrets. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance - leading him directly to Oscorp and the lab of Dr. Curt Connors (Ifans), his father's former partner. As Spider-Man is set on a collision course with Connors' alter-ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero."
    },

    {
        "title":"The amazing spiderman 2",

        "storyC":"We've always known that Spider-Man's most important conflict has been within himself: the struggle between the ordinary obligations of Peter Parker and the extraordinary responsibilities of Spider-Man. But in The Amazing Spider-Man 2, Peter Parker finds that his greatest battle is about to begin. It's great to be Spider-Man. For Peter Parker, there's no feeling quite like swinging between skyscrapers, embracing being the hero, and spending time with Gwen. But being Spider-Man comes at a price: only Spider-Man can protect his fellow New Yorkers from the formidable villains that threaten the city. With the emergence of Electro, Peter must confront a foe far more powerful than he. And as his old friend, Harry Osborn, returns, Peter comes to realize that all of his enemies have one thing in common: Oscorp."
    },

    {
        "title":"Iron Man",

        "storyC":"The playboy wolf and genius Tony Stark is the successful CIO of the Stark Industries, a weapon company founded by his father. His second in command is Obadiah Stane, who worked with his father, and his loyal and professional secretary is Pepper Potts, who has a crush on Tony. While in Afghanistan to demonstrate the ultimate Jericho missile developed by his company, his military convoy is attacked and Tony is seriously wounded on his chest and kidnapped by a group of rebels that wants him to assemble a missile for their use. Tony stays with his abductors for three months and develops a powerful metallic armor to escape from the cave where he is arrested. He decides to stop manufacturing weapons in his company under the protest of Obadiah, and dedicates his time to improve the armor, manufacturing it with gold and titanium and installing a propulsion system to fly. However, Pepper discovers that Tony was betrayed by Obadiah, who is using Tony's data to build prototype armor for him, transforming it in the ultimate weapon."
    },

    {
        "title":"Iron Man 2",

        "storyC":"Now that Tony Stark has revealed to the world that he is Iron Man, the entire world is now eager to get their hands on his hot technology - whether it's the United States government, weapons contractors, or someone else. That someone else happens to be Ivan Vanko - the son of now deceased Anton Vanko, Howard Stark's former partner. Stark had Vanko banished to Russia for conspiring to commit treason against the US, and now Ivan wants revenge against Tony - and he's willing to get it at any cost. But after being humiliated in front of the Senate Armed Forces Committee, rival weapons contractor Justin Hammer sees Ivan as the key to upping his status against Stark Enterprises after an attack on the Monaco 500. But an ailing Tony has to figure out a way to save himself, get Vanko, and get Hammer before the government shows up and takes his beloved suits away. And can he figure out what a mysterious figure named Nick Fury wants with him?"
    },

    {
        "title":"Iron Man 3",

        "storyC":"The events of Loki's attack on New York City has left Tony Stark a completely changed man. Now saddled with a severe case of insomnia and post traumatic stress disorder, Tony spends his sleepless nights the only way he knows how - coming up with new prototypes for the Iron Man suit. But now new events require that Tony suit up again. A villainous mad man known only as the Mandarin has staged a horrible attack on the Chinese Theater in Los Angeles, and is coming for Tony. An angry Tony wants to confront the Mandarin face to face, who proceeds to stage an attack on Tony's Malibu mansion and leaves him with absolutely nothing - no Pepper, no toys except for a defunct Iron Man prototype called the MK42, and he's stranded in the middle of Tennessee. Tony believes the attack on the Chinese Theater and an attack on a small town in Tennessee are related. As he puts the pieces together and tries to get the MK42 working, he discovers far more sinister forces at work greater than the Mandarin himself. But how does an event from Tony's past fit in with the events of the present?"
    },

    {
        "title":"Thor",

        "storyC":"A war is waged between the frost giants and Thor's homeland. Loki fights for his right to the throne. Thor is cast out of Asgard by his father and sent to earth as punishment for his arrogance and disobedience in his battle. He loses his powers of the hammer until it returned to him on earth and he pulls it from the ground. In his fight for his own freedom on earth he meets a scientist; Jane Foster and has an affair with her. Thor then battles the evil forces of his brother Loki along with a robotic giant destroyer that attacks a town."
    },

    {
        "title":"Thor 2",

        "storyC":"Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stop them but their leader Malekith escapes to wait for another opportunity. The warriors find the Aether and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster awaits the return of Thor although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth but his father, Odin refuses to let him. Thor learns from Heimdall, who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to find out what happened to her. When the energy is released again, they discover that when Jane disappeared, she crossed paths with the Aether and it entered her. Malekith, upon sensing that the time to strike is now, seeks out the Aether. He attacks Asgard and Thor's mother Frigga is killed protecting Jane. Odin wants to keep Jane on Asgard so that Malekith will come. Thor disagrees with his plan, so with his cohorts, he decides to take Jane away. He enlists the aid of his brother, Loki. Unfortunately, Loki's motivations remain unknown."
    },

    {
        "title":"Thor 2 the dark world",

        "storyC":"Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stop them but their leader Malekith escapes to wait for another opportunity. The warriors find the Aether and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster awaits the return of Thor although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth but his father, Odin refuses to let him. Thor learns from Heimdall, who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to find out what happened to her. When the energy is released again, they discover that when Jane disappeared, she crossed paths with the Aether and it entered her. Malekith, upon sensing that the time to strike is now, seeks out the Aether. He attacks Asgard and Thor's mother Frigga is killed protecting Jane. Odin wants to keep Jane on Asgard so that Malekith will come. Thor disagrees with his plan, so with his cohorts, he decides to take Jane away. He enlists the aid of his brother, Loki. Unfortunately, Loki's motivations remain unknown."
    },

    {
        "title":"Thor 3",

        "storyC":"Four years after defeating the Dark Elves and two years after the fight in Sokovia, Thor now finds himself trapped on the other side of the universe on the wacky planet of Sakaar. Meanwhile, a new threat rises as the evil Hela, Goddess of Death takes over Asgard and plans to conquer the universe. In order to get home, Thor must compete in a gladiator match against the defending champion of the Grandmaster. Little does Thor know is that the champion is his old friend and fellow Avenger, the Incredible Hulk. Teaming with Hulk and his deceptive brother Loki, Thor must return home to Asgard in time to stop Hela and prevent the approaching Ragnarok, the apocalyptic destruction of Asgard."
    },

    {
        "title":"Thor ragnarok",

        "storyC":"Four years after defeating the Dark Elves and two years after the fight in Sokovia, Thor now finds himself trapped on the other side of the universe on the wacky planet of Sakaar. Meanwhile, a new threat rises as the evil Hela, Goddess of Death takes over Asgard and plans to conquer the universe. In order to get home, Thor must compete in a gladiator match against the defending champion of the Grandmaster. Little does Thor know is that the champion is his old friend and fellow Avenger, the Incredible Hulk. Teaming with Hulk and his deceptive brother Loki, Thor must return home to Asgard in time to stop Hela and prevent the approaching Ragnarok, the apocalyptic destruction of Asgard."
    },

    {
        "title":"captain America",

        "storyC":"During World War 2, Steve Rogers tries to enlist but is repeatedly rejected for his frail and sickly condition, however a scientist notes his determination and allows him to be accepted. What Steve doesn't know is that this scientist is in charge of a government project to create super soldiers, in which Steve is to be the first, but the colonel in charge of the project can't see what the scientist does in this scrawny runt - a strong inner character. Meanwhile, Johann Schmidt, head of a German science division known as HYDRA, knows this scientist and fears the success of his project in America. It could mean trouble for the Germans, so he sends a man to infiltrate and see if it's a success, and take care of the scientist if it is. It is, and he does, but not without Steve and his new abilities chasing him down. With the doctor dead, no more American supermen will be forthcoming, and Steve quickly becomes a mere U.S. war drive propaganda tool called Captain America. His role is useful, if undignified, but he soldiers on with it dutifully till hearing of his best friend's unit's capture, for which he promptly heads out to rescue them. During this rescue, he meets the diabolical Schmidt, and the two become each other's arch nemesis."
    },

    {
        "title":"captain America the first avenger",

        "storyC":"During World War 2, Steve Rogers tries to enlist but is repeatedly rejected for his frail and sickly condition, however a scientist notes his determination and allows him to be accepted. What Steve doesn't know is that this scientist is in charge of a government project to create super soldiers, in which Steve is to be the first, but the colonel in charge of the project can't see what the scientist does in this scrawny runt - a strong inner character. Meanwhile, Johann Schmidt, head of a German science division known as HYDRA, knows this scientist and fears the success of his project in America. It could mean trouble for the Germans, so he sends a man to infiltrate and see if it's a success, and take care of the scientist if it is. It is, and he does, but not without Steve and his new abilities chasing him down. With the doctor dead, no more American supermen will be forthcoming, and Steve quickly becomes a mere U.S. war drive propaganda tool called Captain America. His role is useful, if undignified, but he soldiers on with it dutifully till hearing of his best friend's unit's capture, for which he promptly heads out to rescue them. During this rescue, he meets the diabolical Schmidt, and the two become each other's arch nemesis."
    },

    {
        "title":"captain America 2",

        "storyC":"After commanding a successful rescuing mission of hostages from pirates in a ship, Steve Rogers meets Nick Fury very upset since Natasha Romanoff had different objectives from his. Nick explains that he does not trust anybody but discloses the latest top secret project from SHIELD called Operation Insight that will launch three aircraft carriers into space, linked by a satellite to protect the world. There is an attempt against Nick by the Winter Soldier and Nick goes to Steve's apartment and delivers a flash memory to Steve. He tells that SHIELD is compromised with infiltrated HYDRA agents; then Nick is badly wounded by three shots and goes on surgery. Secretary Alexander Pierce asks Steve why Nick was in his apartment but he refuses to tell. Soon Steve is considered traitor and hunted down by the SHIELD agents and he teams up with Natasha and Sam Falcon Wilson. Now they investigate the reason why Nick was chased and they discover a lethal secret plotted by the HYDRA."
    },

    {
        "title":"captain America the winter soldier",

        "storyC":"After commanding a successful rescuing mission of hostages from pirates in a ship, Steve Rogers meets Nick Fury very upset since Natasha Romanoff had different objectives from his. Nick explains that he does not trust anybody but discloses the latest top secret project from SHIELD called Operation Insight that will launch three aircraft carriers into space, linked by a satellite to protect the world. There is an attempt against Nick by the Winter Soldier and Nick goes to Steve's apartment and delivers a flash memory to Steve. He tells that SHIELD is compromised with infiltrated HYDRA agents; then Nick is badly wounded by three shots and goes on surgery. Secretary Alexander Pierce asks Steve why Nick was in his apartment but he refuses to tell. Soon Steve is considered traitor and hunted down by the SHIELD agents and he teams up with Natasha and Sam Falcon Wilson. Now they investigate the reason why Nick was chased and they discover a lethal secret plotted by the HYDRA."
    },

    {
        "title":"captain America 3",

        "storyC":"When politicians and world leaders think that people like Captain America and Iron Man are running amok, they tell them they need to be regulated. Tony Stark, Iron Man thinks it's necessary. While Steve Rogers, Captain America doesn't think so. That eventually splits their team, The Avengers. At a UN gathering where the regulations are being worked out, there's an explosion and some people are killed among them is the King of Wakanda. Investigation reveals that the bomb was planted by the Winter Soldier, who is Bucky Barnes, Captain America's friend during the war. Everyone is out to get Barnes and kill him if necessary but Steve wants to get to him first and help him. When he finds him he says he didn't plant the bomb, suddenly another person shows up who's out to get him dressed in black. When security forces catches up to them they are arrested and the one in black is revealed to be the son of the Wakandan King, T'Challa and he is the Black Panther the guardian of Wakanda. While in custody, a psychiatrist is sent to evaluate Bucky but suddenly the power goes out that's when he begins to say some words that have an effect on Bucky. He breaks out and Steve tries to get him. Believing that Bucky is innocent Steve sets out to find the man who got to him. Tony is told that because Steve helped Bucky he is now also wanted. He offers to bring him in so he asks War Machine ,and Black Widow to join him. He recruits someone to help him while Widow offers T'Challa to join them. Steve brings Falcon with him who gets Ant Man and Steve calls Hawkeye who gets Wanda whom tony has under lock and key under the eye of Vision. They get away and Vison joins tony. Eventually they all have a confrontation."
    },

    {
        "title":"captain America civil war",

        "storyC":"When politicians and world leaders think that people like Captain America and Iron Man are running amok, they tell them they need to be regulated. Tony Stark, Iron Man thinks it's necessary. While Steve Rogers, Captain America doesn't think so. That eventually splits their team, The Avengers. At a UN gathering where the regulations are being worked out, there's an explosion and some people are killed among them is the King of Wakanda. Investigation reveals that the bomb was planted by the Winter Soldier, who is Bucky Barnes, Captain America's friend during the war. Everyone is out to get Barnes and kill him if necessary but Steve wants to get to him first and help him. When he finds him he says he didn't plant the bomb, suddenly another person shows up who's out to get him dressed in black. When security forces catches up to them they are arrested and the one in black is revealed to be the son of the Wakandan King, T'Challa and he is the Black Panther the guardian of Wakanda. While in custody, a psychiatrist is sent to evaluate Bucky but suddenly the power goes out that's when he begins to say some words that have an effect on Bucky. He breaks out and Steve tries to get him. Believing that Bucky is innocent Steve sets out to find the man who got to him. Tony is told that because Steve helped Bucky he is now also wanted. He offers to bring him in so he asks War Machine ,and Black Widow to join him. He recruits someone to help him while Widow offers T'Challa to join them. Steve brings Falcon with him who gets Ant Man and Steve calls Hawkeye who gets Wanda whom tony has under lock and key under the eye of Vision. They get away and Vison joins tony. Eventually they all have a confrontation."
    },

    {
        "title":"Avengers",

        "storyC":"S.H.I.E.L.D. has located the mysterious Tesseract device and the Army's super soldier Captain America. The Tesseract is actually a gateway to an entirely new world called Asgard. A mysterious being known as Loki arrives on earth and immediately assumes that he can rule all human beings. But that irks S.H.I.E.L.D. director Nick Fury the wrong way. As Loki escapes with the Tesseract, Nick Fury believes this is an act of war against Earth. His only hope is to assemble an actual team of super heroes. Dr. Bruce Banner, who turns into an enormous green rage monster known as the Hulk. Tony Stark and his venerable Iron Man armor. Captain America, the Stark Enterprises created super soldier. Thor, the god of thunder, protector of Earth and his home planet of Asgard, and Loki's brother. Master assassins Hawkeye and Natasha Romanoff. Together they will become a team to take on an attack that will call them to become the greatest of all time."
    },

    {
        "title":" The Avengers",

        "storyC":"S.H.I.E.L.D. has located the mysterious Tesseract device and the Army's super soldier Captain America. The Tesseract is actually a gateway to an entirely new world called Asgard. A mysterious being known as Loki arrives on earth and immediately assumes that he can rule all human beings. But that irks S.H.I.E.L.D. director Nick Fury the wrong way. As Loki escapes with the Tesseract, Nick Fury believes this is an act of war against Earth. His only hope is to assemble an actual team of super heroes. Dr. Bruce Banner, who turns into an enormous green rage monster known as the Hulk. Tony Stark and his venerable Iron Man armor. Captain America, the Stark Enterprises created super soldier. Thor, the god of thunder, protector of Earth and his home planet of Asgard, and Loki's brother. Master assassins Hawkeye and Natasha Romanoff. Together they will become a team to take on an attack that will call them to become the greatest of all time."
    },

    {
        "title":"Avengers 2",

        "storyC":"After a successful raid on a HYDRA base, Tony Stark and Bruce Banner create an Artificial Intelligence called Ultron, a peacekeeping protocol designed to help the Avengers protect the world from their enemies. But things go wrong when Ultron sees the human race as a threat and sets out to destroy it along with the Avengers. Now the Avengers, Iron Man, Thor, Captain America, the Hulk, Black Widow and Hawkeye, must reassemble to stop Ultron from causing mass destruction. Aside from this, the Avengers also must take on the powerful twins Quicksilver and Scarlet Witch as well as the new entity called Vision. Also, the Avengers find that things may never be the same again after discovering a power beyond their comprehension."
    },

    {
        "title":"Avengers age of ultron",

        "storyC":"After a successful raid on a HYDRA base, Tony Stark and Bruce Banner create an Artificial Intelligence called Ultron, a peacekeeping protocol designed to help the Avengers protect the world from their enemies. But things go wrong when Ultron sees the human race as a threat and sets out to destroy it along with the Avengers. Now the Avengers, Iron Man, Thor, Captain America, the Hulk, Black Widow and Hawkeye, must reassemble to stop Ultron from causing mass destruction. Aside from this, the Avengers also must take on the powerful twins Quicksilver and Scarlet Witch as well as the new entity called Vision. Also, the Avengers find that things may never be the same again after discovering a power beyond their comprehension."
    },

    {
        "title":"Avengers 3",

        "storyC":"he mad titan Thanos (Josh Brolin) begins his hunt for the most powerful objects in the universe, the Infinity Stones, in Marvel Studios' highly anticipated Avengers: Infinity War. With the Space Stone, given by Loki (Tom Hiddleston), and the Power Stone, Thanos sends his children (Ebony Maw, Cull Obsidian, Proxima Midnight, and Corvus Glaive) to retrieve the Mind Stone from Vision (Paul Bettany). Meanwhile, Tony Stark (Robert Downey Jr.) meets up with Bruce Banner (Mark Ruffalo) and sorcerers Doctor Strange (Benedict Cumberbatch) and Wong (Benedict Wong). With help from Peter Parker (Tom Holland), A.K.A. Spider-Man, Stark and Strange join forces together and agree to stop Thanos. In space, Thor (Chris Hemsworth) also joins forces with the Guardians of the Galaxy, Star-Lord (Chris Pratt), Drax (Dave Bautista), Rocket (Bradley Cooper), Groot (Vin Diesel), Mantis (Pom Klementieff), and Gamora (Zoe Saldana), the daughter of Thanos who warns Thor of his power. Thor travels away to defeat Thanos with Rocket and Groot while the other Guardians join forces with Stark, Strange, and Parker. In Wakanda, Steve Rogers (Chris Evans) and his team, Black Widow (Scarlett Johansson), Falcon (Anthony Mackie), Scarlet Witch (Elizabeth Olsen), War Machine (Don Cheadle), and Bruce Banner to protect Vision and the Mind Stone in his forehead. With protection given from King T'Challa (Chadwick Boseman), A.K.A. Black Panther, and his Wakandan army, Thanos will come for everyone to destroy half the universe."
    },
    {
        "title":"Avengers Infinty war",

        "storyC":"the mad titan Thanos (Josh Brolin) begins his hunt for the most powerful objects in the universe, the Infinity Stones, in Marvel Studios' highly anticipated Avengers: Infinity War. With the Space Stone, given by Loki (Tom Hiddleston), and the Power Stone, Thanos sends his children (Ebony Maw, Cull Obsidian, Proxima Midnight, and Corvus Glaive) to retrieve the Mind Stone from Vision (Paul Bettany). Meanwhile, Tony Stark (Robert Downey Jr.) meets up with Bruce Banner (Mark Ruffalo) and sorcerers Doctor Strange (Benedict Cumberbatch) and Wong (Benedict Wong). With help from Peter Parker (Tom Holland), A.K.A. Spider-Man, Stark and Strange join forces together and agree to stop Thanos. In space, Thor (Chris Hemsworth) also joins forces with the Guardians of the Galaxy, Star-Lord (Chris Pratt), Drax (Dave Bautista), Rocket (Bradley Cooper), Groot (Vin Diesel), Mantis (Pom Klementieff), and Gamora (Zoe Saldana), the daughter of Thanos who warns Thor of his power. Thor travels away to defeat Thanos with Rocket and Groot while the other Guardians join forces with Stark, Strange, and Parker. In Wakanda, Steve Rogers (Chris Evans) and his team, Black Widow (Scarlett Johansson), Falcon (Anthony Mackie), Scarlet Witch (Elizabeth Olsen), War Machine (Don Cheadle), and Bruce Banner to protect Vision and the Mind Stone in his forehead. With protection given from King T'Challa (Chadwick Boseman), A.K.A. Black Panther, and his Wakandan army, Thanos will come for everyone to destroy half the universe."
    },

    {
        "title":"SMH",

        "storyC":"A young Peter Parker/Spider-Man begins to navigate his newfound identity as the web-slinging super hero Spider-Man. Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark. Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened."
    },

    {
        "title":"Spider man homecoming",

        "storyC":"A young Peter Parker/Spider-Man begins to navigate his newfound identity as the web-slinging super hero Spider-Man. Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark. Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened."
    },

    {
        "title":"doctor strange",

        "storyC":"In New York, the arrogant Dr. Stephen Strange is a talented neurosurgeon with a huge ego. After a car accident, Dr. Strange damages his fingers and loses control of his hands. The surgeon, Christine Palmer, who was his lover, tries to help him. But Dr. Strange unsuccessfully spends his savings searching for an experimental treatment for his fingers. When Dr. Strange learns that the paraplegic Jonathan Pangborn walked again, he seeks him out and is told he was healed in Kamar-Taj. Dr. Strange travels to Katmandu where he meets the sorcerer Mordo and is introduced to The Ancient One. She discloses the astral plan and other dimensions to him and explains that Earth is protected in the mystical plan by three Sanctums (in New York, London, and Hong Kong). However, her former protégé, Kaecilius, has contacted the powerful demon Dormammu in the Dark Dimension and wants to destroy the three Sanctums with his minions to let the Dark Dimension, where time does not exist and anyone can live forever, to rule the world. Will The Ancient One, Dr. Strange and Mordo save the world?"
    },
    {
        "title":"GOTG",

        "storyC":"Kidnapped by aliens when he was young, Peter Quill now travels the galaxy salvaging anything of value for resale. When he comes across a silver orb however, he gets more than he's bargained for. The orb is highly desired many but by none so powerful as Ronan. When Ronan finally acquires it, it's left to Peter and his newfound friends Gamora, Drax, Groot and Rocket to stop him."
    },

    {
        "title":"Guardians of the galaxy",

        "storyC":"Kidnapped by aliens when he was young, Peter Quill now travels the galaxy salvaging anything of value for resale. When he comes across a silver orb however, he gets more than he's bargained for. The orb is highly desired many but by none so powerful as Ronan. When Ronan finally acquires it, it's left to Peter and his newfound friends Gamora, Drax, Groot and Rocket to stop him."
    },
    {
        "title":"GOTG 2",

        "storyC":"The Guardians of the Galaxy are hired by the leader of the well-planned Sovereign race Ayesha to destroy a monster to protect their valuable batteries. Peter Quill, Gamora, Drax, Rocket and Baby Groot defeat the monster and receive the notorious Nebula, who is Gamora estranged sister, as previously agreed to receive the bounty offered for her. However Rocket steals a couple of batteries and their spacecraft is attacked by the Ayesha and Sovereign. Out of the blue, the Sovereign fleet is destroyed by a mysterious ship and the Guardians crash on a planet. Soon they learn that the ship that helped them is owned by Ego, who claims to be Quill's father and invites Quill to visit his planet. He goes with Gamora and Drax while Rocket fix their space craft with Baby Groot and Nebula cuffed to debris. They head to the planet and Gamora and Drax Befriend the empathetic Mantis while Quill learns from the celestial Ego that he has powerful abilities. Meanwhile Ayesha hires the outcast Ravager Yondu Udonta, who raised Quill, to hunt down the Guardians for them."
    },
    {
        "title":"Guardians of the galaxy 2",

        "storyC":"The Guardians of the Galaxy are hired by the leader of the well-planned Sovereign race Ayesha to destroy a monster to protect their valuable batteries. Peter Quill, Gamora, Drax, Rocket and Baby Groot defeat the monster and receive the notorious Nebula, who is Gamora estranged sister, as previously agreed to receive the bounty offered for her. However Rocket steals a couple of batteries and their spacecraft is attacked by the Ayesha and Sovereign. Out of the blue, the Sovereign fleet is destroyed by a mysterious ship and the Guardians crash on a planet. Soon they learn that the ship that helped them is owned by Ego, who claims to be Quill's father and invites Quill to visit his planet. He goes with Gamora and Drax while Rocket fix their space craft with Baby Groot and Nebula cuffed to debris. They head to the planet and Gamora and Drax Befriend the empathetic Mantis while Quill learns from the celestial Ego that he has powerful abilities. Meanwhile Ayesha hires the outcast Ravager Yondu Udonta, who raised Quill, to hunt down the Guardians for them."
    },

    {
        "title":"the Matrix",

        "storyC":"Thomas A. Anderson ids a man leading a double life. By day, he isu an average computer programmer who pays his taxes and helps his landlady take out the garbage. At night, he is a computer hacker by the name of Neo. He finds himself targeted by police when he is contacted by the legendary hacker Morpheus. Neo wakes up in the real world, a ravaged wasteland. He finds out that most human r are not born, but are created by machines so that they're not a can harvest their bioelectric and heat energy and fulfill their electricity needs. The minds of such people are imprisoned in an artificial reality known as the Matrix. Now a rebel, Neo learns about his role in the reality and must confront the agents, programs which all rebels fear, who plan on destroying the rebels and destroying the entire human existence."
    },
    

    {
        "title":"the Matrix 2",

        "storyC":"Six months after the events depicted in The Matrix, Neo has proved to be a good omen for the free humans, as more and more humans are being freed from the matrix and brought to Zion, the one and only stronghold of the Resistance. Neo himself has discovered his superpowers including super speed, ability to see the codes of the things inside the matrix, and a certain degree of precognition. But a nasty piece of news hits the human resistance: 250,000 machine sentinels are digging to Zion and would reach them in 72 hours. As Zion prepares for the ultimate war, Neo, Morpheus and Trinity are advised by the Oracle to find the Keymaker who would help them reach the Source. Meanwhile Neo's recurrent dreams depicting Trinity's death have got him worried and as if it was not enough, Agent Smith has somehow escaped deletion, has become more powerful than before and has chosen Neo as his next target."
    },

    {
        "title":"the Matrix reloaded",

        "storyC":"Six months after the events depicted in The Matrix, Neo has proved to be a good omen for the free humans, as more and more humans are being freed from the matrix and brought to Zion, the one and only stronghold of the Resistance. Neo himself has discovered his superpowers including super speed, ability to see the codes of the things inside the matrix, and a certain degree of precognition. But a nasty piece of news hits the human resistance: 250,000 machine sentinels are digging to Zion and would reach them in 72 hours. As Zion prepares for the ultimate war, Neo, Morpheus and Trinity are advised by the Oracle to find the Keymaker who would help them reach the Source. Meanwhile Neo's recurrent dreams depicting Trinity's death have got him worried and as if it was not enough, Agent Smith has somehow escaped deletion, has become more powerful than before and has chosen Neo as his next target."
    },

    {
        "title":"the Matrix 3",

        "storyC":"As Neo somehow becomes trapped in a train station between The Matrix and the real world, Morpheus, Trinity, and Seraph set out to rescue him by means of the Merovingian. As this is going on, the Machines are approaching Zion with the intent of laying waste to every human there, but they do not realize that something is taking over The Matrix, with the intent of destroying everything: Smith. After Neo is freed, he and Trinity take the Logos and make a beeline for the Machine City. The Machines have reached Zion and the battle of a lifetime rages on. However, there is one way to save Zion and put an end to the war, and that is Neo. He must venture into the Matrix and put an end to Smith's evil plans once and for all, and if he succeeds, Zion will live to see another day. It's like the Oracle says, Everything that has a beginning has an end."
    },

    {
        "title":"the Matrix revolutions ",

        "storyC":"As Neo somehow becomes trapped in a train station between The Matrix and the real world, Morpheus, Trinity, and Seraph set out to rescue him by means of the Merovingian. As this is going on, the Machines are approaching Zion with the intent of laying waste to every human there, but they do not realize that something is taking over The Matrix, with the intent of destroying everything: Smith. After Neo is freed, he and Trinity take the Logos and make a beeline for the Machine City. The Machines have reached Zion and the battle of a lifetime rages on. However, there is one way to save Zion and put an end to the war, and that is Neo. He must venture into the Matrix and put an end to Smith's evil plans once and for all, and if he succeeds, Zion will live to see another day. It's like the Oracle says, Everything that has a beginning has an end."
    },

    {
        "title":"the godfather",

        "storyC":"Vito Corleone is the aging don (head) of the Corleone Mafia Family. His youngest son Michael has returned from WWII just in time to see the wedding of Connie Corleone (Michael's sister) to Carlo Rizzi. All of Michael's family is involved with the Mafia, but Michael just wants to live a normal life. Drug dealer Virgil Sollozzo is looking for Mafia families to offer him protection in exchange for a profit of the drug money. He approaches Don Corleone about it, but, much against the advice of the Don's lawyer Tom Hagen, the Don is morally against the use of drugs, and turns down the offer. This does not please Sollozzo, who has the Don shot down by some of his hit men. The Don barely survives, which leads his son Michael to begin a violent mob war against Sollozzo and tears the Corleone family apart."
    },

    {
        "title":"the godfather 2",

        "storyC":"The continuation of the Godfather saga with two focuses: the ongoing story of the Corleone family, and Michael in particular, and Vito Corleone's (Michael's father) backstory. Regarding the ongoing Michael Corleone story, it is about seven years since the events that concluded The Godfather. With the murders of the heads of the other four New York / New Jersey families, the Corleone family has unassailable control in New York. The move to Nevada went smoothly and Michael Corleone controls several hotels and casinos in the state. Frank Pentageli, the man who runs Michael's interests in New York, comes to Michael, asking if he can take out the Rosato Brothers as they are infringing on Pentageli's turf and business interests. However, the Rosatos are backed by Hyman Roth, a business partner of Michael's and a long- time ally of Michael's father, Vito Corleone, and Michael refuses. An attempted assassination attempt is then carried out on Michael's life, in his own home. Michael investigates who is trying to kill him, and suspects that there is a traitor in his family. Meanwhile. Michael and Hyman Roth fly to Cuba to finalise some business deals there. The Cuban trip reveals all. In a story interwoven with the present day, we see the backstory to Vito Corleone. From how his parents and brother were murdered by a Don in their home town of Corleone in Sicily, to his escaping, as a boy, to New York, his adult life and his rise to Don Corleone."
    },

    {
        "title":"the godfather 3",

        "storyC":"It is 1979, about 22 years since the events of The Godfather II. For Michael Corleone, the move to legitimacy is complete: the New York crime business has been handed over to Joey Zasa and all elements of the Corleone business empire are legal, non-criminal enterprises. Michael, approaching 60, is now thinking about his legacy. His charity, run by his daughter Mary, has just handed over $100 million to the Catholic Church. Michael also intends buying a large stake in International Immobiliari, a Vatican-run property company. Things are peaceful and stable but then Vincent Mancini, Sonny Corleone's illegitimate son, starts a feud with Joey Zasa. This has far-reaching, deadly consequences, including for Michael's deal with the Vatican."
    }

















    ]

   